import React from 'react';
import './Article.css'
import './Readmore.css'
// import './Readmore'
const Article = () => {
    return (
        //    <div className="news">
        //        <h3 className="title">আসুন রক্ত দেওয়ার আগে কিছু তথ্য জেনে নেই।</h3>
        //        <div className="container">
        //         <div className="row">
        //         <div className="col-12 col-md-4">
        //         <div  className="card">
        //         <div className="card-body">
        //             <div className="card-title"> <h3 className="headline">রক্তদানের উপকারিতা</h3> </div>
        //             <div className="card-text">
        //             <p>
        //             দেশের বিভিন্ন ব্লাডব্যাংকের সঙ্গে কথা বলে জানা যায় নিয়মিত রক্ত দেয়ার কিছু উপকার রয়েছে। সেগুলো হলো:
        //             ১. এতে একজন মানুষের জীবন বাঁচানো সম্ভব। ২. নিয়মিত রক্তদাতাদের ক্যানসারে আক্রান্ত হওয়ার ঝুঁকি কম থাকে।
        //             ৩. বছরে তিনবার রক্ত দিলে শরীরে নতুন লোহিত কণিকা তৈরির হার বেড়ে যায়।<span className="read-more-text"> এতে অস্থিমজ্জা সক্রিয় থাকে। দ্রুত রক্ত স্বল্পতা পূরণ হয়।
        //             ৪. রক্তে কোলেস্টরেলের মাত্রা কমে যায়, এতে রক্তচাপ নিয়ন্ত্রণে থাকে। ফলে হৃদরোগ ও হার্ট অ্যাটাকের ঝুঁকি অনেকটাই কমে যায়।
        //             ৫. রক্ত দিলে যে ক্যালোরি খরচ হয়, তা ওজন কমানোর ক্ষেত্রে ও রক্তচাপ নিয়ন্ত্রণে গুরুত্বপূর্ণ ভূমিকা রাখে। ৬. শরীরে হেপাটাইটিস-বি, হেপাটাইটিস-সি, জন্ডিস, ম্যালেরিয়া, সিফিলিস, এইচআইভি বা এইডসের মতো বড় কোন রোগ আছে কি না, সেটি বিনা খরচে জানা যায়।
        //             ৭. রোগ প্রতিরোধ ক্ষমতা বাড়ে। ৮. রক্তদাতার যদি নিজের কখনো রক্তের প্রয়োজন হয় তাহলে ব্লাড ব্যাংকগুলো তাকে অগ্রাধিকার দিয়ে রক্তের ব্যবস্থা করে দেয়।
        //             </span>
        //             <span className="btn-read-more"> Read More</span>
        //             </p>
        //             </div>
        //         </div>
        //         </div>
        //         </div>
        //         <div className="col-12 col-md-4">
        //         <div  className="card">
        //         <div className="card-body">
        //             <div className="card-title"><h3 className="headline">রক্ত দেওয়ার আগে করনীয়</h3></div>
        //             <div className="card-text">
        //             <p>
        //             ১. রক্তদাতা যদি কোনো কারণে অসুস্থবোধ করেন তবে সেদিনের মতো রক্ত দেয়া থেকে বিরত থাকুন।
        //             ২. রক্ত দেয়ার আগে পুষ্টিকর খাবার খেয়ে নিন, কিন্তু তৈলাক্ত কিছু খাবেন না।
        //             ৩. রক্ত দানের আগে প্রচুর পরিমাণে পানি ও পানি জাতীয় খাবার খাবেন।
        //             ৪. যেদিন রক্ত দেবেন তার আগের রাতে অনেকটা সময় ভালো করে ঘুমিয়ে নেবেন।
        //             </p>
        //             </div>
        //         </div>
        //         </div>
        //         </div>
        //         <div className="col-12 col-md-4">
        //         <div  className="card">
        //         <div className="card-body">
        //             <div className="card-title"><h3 className="headline">রক্ত দেওয়ার পরে করনীয়</h3></div>
        //             <div className="card-text">
        //            <p>
        //             ১. অনেকটা সময় শুয়ে থাকবেন। হুট করে উঠে বসবেন না বা উঠে দাঁড়াবেন না।
        //             ২. প্রচুর পরিমাণে পানি ও পানি জাতীয় খাবার গ্রহণ করুন। এই ব্যাপারে মোটেও অবহেলা করবেন না।
        //             ৩. আয়রন, ফোলাইট, রিবোফ্লাবিন, ভিটামিন বি৬ সমৃদ্ধ খাবার যেমন লাল মাংস, মাছ, ডিম, কিশমিশ, কলা ইত্যাদি <span className="read-more-text"> ধরণের খাবার বেশি করে খাবেন।
        //             ৪. কয়েক ঘণ্টার জন্য শারীরিক পরিশ্রমের কাজ করা থেকে বিরত থাকুন এবং বেশ কিছুদিন সাধারণ সময়ের তুলনায় একটু কম পরিশ্রম করে বিশ্রাম নিন।
        //             ৫. রক্তদানের ৩ মাস পর নতুন করে রক্ত দিতে পারবেন। এর আগে কোনেভাবেই পুনরায় রক্ত দেবেন না।
        //             </span>
        //             <span className="btn-read-more"> Read More</span>
        //             </p>
        //             </div>
        //         </div>
        //         </div>
        //         </div>
        //     </div>
        //     </div>
        //    </div>
       <div className="article">
           <div className="row">
               <div className="col-lg-4">
                   <div className="feature-col">
                       <h3 className="text-bold">রক্তদানের উপকারিতা</h3>
                       <p className="small">
                        দেশের বিভিন্ন ব্লাডব্যাংকের সঙ্গে কথা বলে জানা যায় নিয়মিত রক্ত দেয়ার কিছু উপকার রয়েছে। সেগুলো হলো:
                        ১. এতে একজন মানুষের জীবন বাঁচানো সম্ভব। ২. নিয়মিত রক্তদাতাদের ক্যানসারে আক্রান্ত হওয়ার ঝুঁকি কম থাকে।
                        ৩. বছরে তিনবার রক্ত দিলে শরীরে নতুন লোহিত কণিকা তৈরির হার বেড়ে যায়।<span className="read-more-text"> এতে অস্থিমজ্জা সক্রিয় থাকে। দ্রুত রক্ত স্বল্পতা পূরণ হয়।
                        ৪. রক্তে কোলেস্টরেলের মাত্রা কমে যায়, এতে রক্তচাপ নিয়ন্ত্রণে থাকে। ফলে হৃদরোগ ও হার্ট অ্যাটাকের ঝুঁকি অনেকটাই কমে যায়।
                        ৫. রক্ত দিলে যে ক্যালোরি খরচ হয়, তা ওজন কমানোর ক্ষেত্রে ও রক্তচাপ নিয়ন্ত্রণে গুরুত্বপূর্ণ ভূমিকা রাখে। ৬. শরীরে হেপাটাইটিস-বি, হেপাটাইটিস-সি, জন্ডিস, ম্যালেরিয়া, সিফিলিস, এইচআইভি বা এইডসের মতো বড় কোন রোগ আছে কি না, সেটি বিনা খরচে জানা যায়।
                        ৭. রোগ প্রতিরোধ ক্ষমতা বাড়ে। ৮. রক্তদাতার যদি নিজের কখনো রক্তের প্রয়োজন হয় তাহলে ব্লাড ব্যাংকগুলো তাকে অগ্রাধিকার দিয়ে রক্তের ব্যবস্থা করে দেয়।
                     </span>
                     <span className="btn-read-more"> Read More</span>
                     </p>
                   </div>
               </div>
               <div className="col-lg-4">
                   <div className="feature-col">
                       <h3 className="text-bold">রক্ত দেওয়ার আগে করনীয়</h3>
                       <p className="small">
                            ১. রক্তদাতা যদি কোনো কারণে অসুস্থবোধ করেন তবে সেদিনের মতো রক্ত দেয়া থেকে বিরত থাকুন।
                            ২. রক্ত দেয়ার আগে পুষ্টিকর খাবার খেয়ে নিন, কিন্তু তৈলাক্ত কিছু খাবেন না।
                            ৩. রক্ত দানের আগে প্রচুর পরিমাণে পানি ও পানি জাতীয় খাবার খাবেন।
                            ৪. যেদিন রক্ত দেবেন তার আগের রাতে অনেকটা সময় ভালো করে ঘুমিয়ে নেবেন।
                     </p>
                   </div>
               </div>
               <div className="col-lg-4">
                   <div className="feature-col">
                       <h3 className="text-bold">রক্তদানের উপকারিতা</h3>
                       <p className="small">
                        ১. অনেকটা সময় শুয়ে থাকবেন। হুট করে উঠে বসবেন না বা উঠে দাঁড়াবেন না।
                        ২. প্রচুর পরিমাণে পানি ও পানি জাতীয় খাবার গ্রহণ করুন। এই ব্যাপারে মোটেও অবহেলা করবেন না।
                        ৩. আয়রন, ফোলাইট, রিবোফ্লাবিন, ভিটামিন বি৬ সমৃদ্ধ খাবার যেমন লাল মাংস, মাছ, ডিম, কিশমিশ, কলা ইত্যাদি <span className="read-more-text"> ধরণের খাবার বেশি করে খাবেন।
                        ৪. কয়েক ঘণ্টার জন্য শারীরিক পরিশ্রমের কাজ করা থেকে বিরত থাকুন এবং বেশ কিছুদিন সাধারণ সময়ের তুলনায় একটু কম পরিশ্রম করে বিশ্রাম নিন।
                        ৫. রক্তদানের ৩ মাস পর নতুন করে রক্ত দিতে পারবেন। এর আগে কোনেভাবেই পুনরায় রক্ত দেবেন না।
                        </span>
                        <span className="btn-read-more"> Read More</span>
                     </p>
                   </div>
               </div>
           </div>
       </div>
    );
};

export default Article;